; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l36_p36_c36_g36_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	loc36 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	crate36 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(at crate31 depot)
	(at crate32 depot)
	(at crate33 depot)
	(at crate34 depot)
	(at crate35 depot)
	(at crate36 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 food)
	(crate-content crate19 food)
	(crate-content crate20 food)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(crate-content crate29 medicine)
	(crate-content crate30 medicine)
	(crate-content crate31 medicine)
	(crate-content crate32 medicine)
	(crate-content crate33 medicine)
	(crate-content crate34 medicine)
	(crate-content crate35 medicine)
	(crate-content crate36 medicine)
	(at person1 loc1)
	(at person2 loc9)
	(at person3 loc23)
	(at person4 loc23)
	(at person5 loc24)
	(at person6 loc32)
	(at person7 loc9)
	(at person8 loc31)
	(at person9 loc25)
	(at person10 loc15)
	(at person11 loc5)
	(at person12 loc25)
	(at person13 loc24)
	(at person14 loc9)
	(at person15 loc11)
	(at person16 loc31)
	(at person17 loc7)
	(at person18 loc19)
	(at person19 loc22)
	(at person20 loc30)
	(at person21 loc13)
	(at person22 loc22)
	(at person23 loc22)
	(at person24 loc7)
	(at person25 loc29)
	(at person26 loc23)
	(at person27 loc21)
	(at person28 loc26)
	(at person29 loc26)
	(at person30 loc18)
	(at person31 loc17)
	(at person32 loc1)
	(at person33 loc6)
	(at person34 loc7)
	(at person35 loc8)
	(at person36 loc25)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 food)
	(person-needs person3 medicine)
	(person-needs person4 food)
	(person-needs person4 medicine)
	(person-needs person5 food)
	(person-needs person5 medicine)
	(person-needs person8 food)
	(person-needs person8 medicine)
	(person-needs person9 food)
	(person-needs person10 medicine)
	(person-needs person12 food)
	(person-needs person13 food)
	(person-needs person14 medicine)
	(person-needs person15 medicine)
	(person-needs person17 food)
	(person-needs person18 medicine)
	(person-needs person19 food)
	(person-needs person20 food)
	(person-needs person21 medicine)
	(person-needs person23 food)
	(person-needs person23 medicine)
	(person-needs person24 food)
	(person-needs person24 medicine)
	(person-needs person25 food)
	(person-needs person25 medicine)
	(person-needs person28 food)
	(person-needs person28 medicine)
	(person-needs person30 food)
	(person-needs person30 medicine)
	(person-needs person31 food)
	(person-needs person33 food)
	(person-needs person34 food)
	(person-needs person34 medicine)
	(person-needs person36 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person5 food)
	(person-has person5 medicine)
	(person-has person8 food)
	(person-has person8 medicine)
	(person-has person9 food)
	(person-has person10 medicine)
	(person-has person12 food)
	(person-has person13 food)
	(person-has person14 medicine)
	(person-has person15 medicine)
	(person-has person17 food)
	(person-has person18 medicine)
	(person-has person19 food)
	(person-has person20 food)
	(person-has person21 medicine)
	(person-has person23 food)
	(person-has person23 medicine)
	(person-has person24 food)
	(person-has person24 medicine)
	(person-has person25 food)
	(person-has person25 medicine)
	(person-has person28 food)
	(person-has person28 medicine)
	(person-has person30 food)
	(person-has person30 medicine)
	(person-has person31 food)
	(person-has person33 food)
	(person-has person34 food)
	(person-has person34 medicine)
	(person-has person36 food)
	))
)

; plan
1. (grab-arm2 drone1 crate36 depot)
   deleted: (arm2-free drone1) (at crate36 depot)
   added: (arm2-load drone1 crate36)
   goals met: 1 of 37
2. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 1 of 37
3. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 0 of 37
4. (deliver-arm2 drone1 person10 crate36 medicine loc15)
   deleted: (arm2-load drone1 crate36) (person-needs person10 medicine)
   added: (arm2-free drone1) (person-has person10 medicine)
   goals met: 1 of 37
5. (move-drone drone1 loc15 loc30)
   deleted: (at drone1 loc15)
   added: (at drone1 loc30)
   goals met: 1 of 37
6. (move-drone drone1 loc30 depot)
   deleted: (at drone1 loc30)
   added: (at drone1 depot)
   goals met: 2 of 37
7. (grab-arm2 drone1 crate35 depot)
   deleted: (arm2-free drone1) (at crate35 depot)
   added: (arm2-load drone1 crate35)
   goals met: 2 of 37
8. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 1 of 37
9. (deliver-arm2 drone1 person15 crate35 medicine loc11)
   deleted: (arm2-load drone1 crate35) (person-needs person15 medicine)
   added: (arm2-free drone1) (person-has person15 medicine)
   goals met: 2 of 37
10. (move-drone drone1 loc11 loc30)
   deleted: (at drone1 loc11)
   added: (at drone1 loc30)
   goals met: 2 of 37
11. (move-drone drone1 loc30 depot)
   deleted: (at drone1 loc30)
   added: (at drone1 depot)
   goals met: 3 of 37
12. (grab-arm2 drone1 crate34 depot)
   deleted: (arm2-free drone1) (at crate34 depot)
   added: (arm2-load drone1 crate34)
   goals met: 3 of 37
13. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 2 of 37
14. (deliver-arm2 drone1 person18 crate34 medicine loc19)
   deleted: (arm2-load drone1 crate34) (person-needs person18 medicine)
   added: (arm2-free drone1) (person-has person18 medicine)
   goals met: 3 of 37
15. (move-drone drone1 loc19 loc30)
   deleted: (at drone1 loc19)
   added: (at drone1 loc30)
   goals met: 3 of 37
16. (move-drone drone1 loc30 depot)
   deleted: (at drone1 loc30)
   added: (at drone1 depot)
   goals met: 4 of 37
17. (grab-arm2 drone1 crate33 depot)
   deleted: (arm2-free drone1) (at crate33 depot)
   added: (arm2-load drone1 crate33)
   goals met: 4 of 37
18. (move-drone drone1 depot loc30)
   deleted: (at drone1 depot)
   added: (at drone1 loc30)
   goals met: 3 of 37
19. (deliver-arm1 drone1 person20 crate20 food loc30)
   deleted: (arm1-load drone1 crate20) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 4 of 37
20. (move-drone drone1 loc30 loc13)
   deleted: (at drone1 loc30)
   added: (at drone1 loc13)
   goals met: 4 of 37
21. (deliver-arm2 drone1 person21 crate33 medicine loc13)
   deleted: (arm2-load drone1 crate33) (person-needs person21 medicine)
   added: (arm2-free drone1) (person-has person21 medicine)
   goals met: 5 of 37
22. (move-drone drone1 loc13 loc23)
   deleted: (at drone1 loc13)
   added: (at drone1 loc23)
   goals met: 5 of 37
23. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 6 of 37
24. (grab-arm2 drone1 crate32 depot)
   deleted: (arm2-free drone1) (at crate32 depot)
   added: (arm2-load drone1 crate32)
   goals met: 6 of 37
25. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 6 of 37
26. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 5 of 37
27. (deliver-arm1 drone1 person31 crate19 food loc17)
   deleted: (arm1-load drone1 crate19) (person-needs person31 food)
   added: (arm1-free drone1) (person-has person31 food)
   goals met: 6 of 37
28. (move-drone drone1 loc17 loc9)
   deleted: (at drone1 loc17)
   added: (at drone1 loc9)
   goals met: 6 of 37
29. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 7 of 37
30. (grab-arm1 drone1 crate18 depot)
   deleted: (arm1-free drone1) (at crate18 depot)
   added: (arm1-load drone1 crate18)
   goals met: 7 of 37
31. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 6 of 37
32. (deliver-arm1 drone1 person33 crate18 food loc6)
   deleted: (arm1-load drone1 crate18) (person-needs person33 food)
   added: (arm1-free drone1) (person-has person33 food)
   goals met: 7 of 37
33. (move-drone drone1 loc6 loc9)
   deleted: (at drone1 loc6)
   added: (at drone1 loc9)
   goals met: 7 of 37
34. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 8 of 37
35. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 8 of 37
36. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 7 of 37
37. (deliver-arm1 drone1 person3 crate17 food loc23)
   deleted: (arm1-load drone1 crate17) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 8 of 37
38. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 9 of 37
39. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 9 of 37
40. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 8 of 37
41. (deliver-arm2 drone1 person3 crate32 medicine loc23)
   deleted: (arm2-load drone1 crate32) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 9 of 37
42. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 10 of 37
43. (grab-arm2 drone1 crate31 depot)
   deleted: (arm2-free drone1) (at crate31 depot)
   added: (arm2-load drone1 crate31)
   goals met: 10 of 37
44. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 9 of 37
45. (deliver-arm1 drone1 person4 crate16 food loc23)
   deleted: (arm1-load drone1 crate16) (person-needs person4 food)
   added: (arm1-free drone1) (person-has person4 food)
   goals met: 10 of 37
46. (deliver-arm2 drone1 person4 crate31 medicine loc23)
   deleted: (arm2-load drone1 crate31) (person-needs person4 medicine)
   added: (arm2-free drone1) (person-has person4 medicine)
   goals met: 11 of 37
47. (move-drone drone1 loc23 loc31)
   deleted: (at drone1 loc23)
   added: (at drone1 loc31)
   goals met: 11 of 37
48. (move-drone drone1 loc31 depot)
   deleted: (at drone1 loc31)
   added: (at drone1 depot)
   goals met: 12 of 37
49. (grab-arm2 drone1 crate30 depot)
   deleted: (arm2-free drone1) (at crate30 depot)
   added: (arm2-load drone1 crate30)
   goals met: 12 of 37
50. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 12 of 37
51. (move-drone drone1 depot loc31)
   deleted: (at drone1 depot)
   added: (at drone1 loc31)
   goals met: 11 of 37
52. (deliver-arm1 drone1 person8 crate15 food loc31)
   deleted: (arm1-load drone1 crate15) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 12 of 37
53. (deliver-arm2 drone1 person8 crate30 medicine loc31)
   deleted: (arm2-load drone1 crate30) (person-needs person8 medicine)
   added: (arm2-free drone1) (person-has person8 medicine)
   goals met: 13 of 37
54. (move-drone drone1 loc31 loc24)
   deleted: (at drone1 loc31)
   added: (at drone1 loc24)
   goals met: 13 of 37
55. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 14 of 37
56. (grab-arm2 drone1 crate29 depot)
   deleted: (arm2-free drone1) (at crate29 depot)
   added: (arm2-load drone1 crate29)
   goals met: 14 of 37
57. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 14 of 37
58. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 13 of 37
59. (deliver-arm1 drone1 person5 crate14 food loc24)
   deleted: (arm1-load drone1 crate14) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 14 of 37
60. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 15 of 37
61. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 15 of 37
62. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 14 of 37
63. (deliver-arm2 drone1 person5 crate29 medicine loc24)
   deleted: (arm2-load drone1 crate29) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 15 of 37
64. (move-drone drone1 loc24 depot)
   deleted: (at drone1 loc24)
   added: (at drone1 depot)
   goals met: 16 of 37
65. (grab-arm2 drone1 crate28 depot)
   deleted: (arm2-free drone1) (at crate28 depot)
   added: (arm2-load drone1 crate28)
   goals met: 16 of 37
66. (move-drone drone1 depot loc24)
   deleted: (at drone1 depot)
   added: (at drone1 loc24)
   goals met: 15 of 37
67. (deliver-arm1 drone1 person13 crate13 food loc24)
   deleted: (arm1-load drone1 crate13) (person-needs person13 food)
   added: (arm1-free drone1) (person-has person13 food)
   goals met: 16 of 37
68. (move-drone drone1 loc24 loc9)
   deleted: (at drone1 loc24)
   added: (at drone1 loc9)
   goals met: 16 of 37
69. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 17 of 37
70. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 17 of 37
71. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 16 of 37
72. (deliver-arm1 drone1 person2 crate12 food loc9)
   deleted: (arm1-load drone1 crate12) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 17 of 37
73. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 18 of 37
74. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 18 of 37
75. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 17 of 37
76. (deliver-arm2 drone1 person2 crate28 medicine loc9)
   deleted: (arm2-load drone1 crate28) (person-needs person2 medicine)
   added: (arm2-free drone1) (person-has person2 medicine)
   goals met: 18 of 37
77. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 19 of 37
78. (grab-arm2 drone1 crate27 depot)
   deleted: (arm2-free drone1) (at crate27 depot)
   added: (arm2-load drone1 crate27)
   goals met: 19 of 37
79. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 18 of 37
80. (deliver-arm2 drone1 person14 crate27 medicine loc9)
   deleted: (arm2-load drone1 crate27) (person-needs person14 medicine)
   added: (arm2-free drone1) (person-has person14 medicine)
   goals met: 19 of 37
81. (move-drone drone1 loc9 loc25)
   deleted: (at drone1 loc9)
   added: (at drone1 loc25)
   goals met: 19 of 37
82. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 20 of 37
83. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 20 of 37
84. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 19 of 37
85. (deliver-arm1 drone1 person19 crate11 food loc22)
   deleted: (arm1-load drone1 crate11) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 20 of 37
86. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 21 of 37
87. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 21 of 37
88. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 20 of 37
89. (deliver-arm1 drone1 person23 crate10 food loc22)
   deleted: (arm1-load drone1 crate10) (person-needs person23 food)
   added: (arm1-free drone1) (person-has person23 food)
   goals met: 21 of 37
90. (deliver-arm2 drone1 person23 crate26 medicine loc22)
   deleted: (arm2-load drone1 crate26) (person-needs person23 medicine)
   added: (arm2-free drone1) (person-has person23 medicine)
   goals met: 22 of 37
91. (move-drone drone1 loc22 loc29)
   deleted: (at drone1 loc22)
   added: (at drone1 loc29)
   goals met: 22 of 37
92. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 23 of 37
93. (grab-arm2 drone1 crate25 depot)
   deleted: (arm2-free drone1) (at crate25 depot)
   added: (arm2-load drone1 crate25)
   goals met: 23 of 37
94. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 23 of 37
95. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 22 of 37
96. (deliver-arm1 drone1 person25 crate9 food loc29)
   deleted: (arm1-load drone1 crate9) (person-needs person25 food)
   added: (arm1-free drone1) (person-has person25 food)
   goals met: 23 of 37
97. (deliver-arm2 drone1 person25 crate25 medicine loc29)
   deleted: (arm2-load drone1 crate25) (person-needs person25 medicine)
   added: (arm2-free drone1) (person-has person25 medicine)
   goals met: 24 of 37
98. (move-drone drone1 loc29 loc26)
   deleted: (at drone1 loc29)
   added: (at drone1 loc26)
   goals met: 24 of 37
99. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 25 of 37
100. (grab-arm2 drone1 crate24 depot)
   deleted: (arm2-free drone1) (at crate24 depot)
   added: (arm2-load drone1 crate24)
   goals met: 25 of 37
101. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 25 of 37
102. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 24 of 37
103. (deliver-arm1 drone1 person28 crate8 food loc26)
   deleted: (arm1-load drone1 crate8) (person-needs person28 food)
   added: (arm1-free drone1) (person-has person28 food)
   goals met: 25 of 37
104. (deliver-arm2 drone1 person28 crate24 medicine loc26)
   deleted: (arm2-load drone1 crate24) (person-needs person28 medicine)
   added: (arm2-free drone1) (person-has person28 medicine)
   goals met: 26 of 37
105. (move-drone drone1 loc26 loc18)
   deleted: (at drone1 loc26)
   added: (at drone1 loc18)
   goals met: 26 of 37
106. (move-drone drone1 loc18 depot)
   deleted: (at drone1 loc18)
   added: (at drone1 depot)
   goals met: 27 of 37
107. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 27 of 37
108. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 27 of 37
109. (move-drone drone1 depot loc18)
   deleted: (at drone1 depot)
   added: (at drone1 loc18)
   goals met: 26 of 37
110. (deliver-arm1 drone1 person30 crate7 food loc18)
   deleted: (arm1-load drone1 crate7) (person-needs person30 food)
   added: (arm1-free drone1) (person-has person30 food)
   goals met: 27 of 37
111. (deliver-arm2 drone1 person30 crate23 medicine loc18)
   deleted: (arm2-load drone1 crate23) (person-needs person30 medicine)
   added: (arm2-free drone1) (person-has person30 medicine)
   goals met: 28 of 37
112. (move-drone drone1 loc18 loc7)
   deleted: (at drone1 loc18)
   added: (at drone1 loc7)
   goals met: 28 of 37
113. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 29 of 37
114. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 29 of 37
115. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 29 of 37
116. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 28 of 37
117. (deliver-arm1 drone1 person17 crate6 food loc7)
   deleted: (arm1-load drone1 crate6) (person-needs person17 food)
   added: (arm1-free drone1) (person-has person17 food)
   goals met: 29 of 37
118. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 30 of 37
119. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 30 of 37
120. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 29 of 37
121. (deliver-arm1 drone1 person24 crate5 food loc7)
   deleted: (arm1-load drone1 crate5) (person-needs person24 food)
   added: (arm1-free drone1) (person-has person24 food)
   goals met: 30 of 37
122. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 31 of 37
123. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 31 of 37
124. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 30 of 37
125. (deliver-arm2 drone1 person24 crate22 medicine loc7)
   deleted: (arm2-load drone1 crate22) (person-needs person24 medicine)
   added: (arm2-free drone1) (person-has person24 medicine)
   goals met: 31 of 37
126. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 32 of 37
127. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 32 of 37
128. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 31 of 37
129. (deliver-arm2 drone1 person34 crate21 medicine loc7)
   deleted: (arm2-load drone1 crate21) (person-needs person34 medicine)
   added: (arm2-free drone1) (person-has person34 medicine)
   goals met: 32 of 37
130. (deliver-arm1 drone1 person34 crate4 food loc7)
   deleted: (arm1-load drone1 crate4) (person-needs person34 food)
   added: (arm1-free drone1) (person-has person34 food)
   goals met: 33 of 37
131. (move-drone drone1 loc7 loc25)
   deleted: (at drone1 loc7)
   added: (at drone1 loc25)
   goals met: 33 of 37
132. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 34 of 37
133. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 34 of 37
134. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 33 of 37
135. (deliver-arm2 drone1 person9 crate3 food loc25)
   deleted: (arm2-load drone1 crate3) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 34 of 37
136. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 35 of 37
137. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 35 of 37
138. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 34 of 37
139. (deliver-arm2 drone1 person12 crate2 food loc25)
   deleted: (arm2-load drone1 crate2) (person-needs person12 food)
   added: (arm2-free drone1) (person-has person12 food)
   goals met: 35 of 37
140. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 36 of 37
141. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 36 of 37
142. (move-drone drone1 depot loc25)
   deleted: (at drone1 depot)
   added: (at drone1 loc25)
   goals met: 35 of 37
143. (deliver-arm2 drone1 person36 crate1 food loc25)
   deleted: (arm2-load drone1 crate1) (person-needs person36 food)
   added: (arm2-free drone1) (person-has person36 food)
   goals met: 36 of 37
144. (move-drone drone1 loc25 depot)
   deleted: (at drone1 loc25)
   added: (at drone1 depot)
   goals met: 37 of 37
